Revit 2024 API
StairsRunType.RiserProfile Property
 The id of the profile of the risers.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId RiserProfile { get; set; }
Visual Basic
Public Property RiserProfile As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ RiserProfile {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The profile is neither a valid element id nor invalidElementId. -or- When setting this property: The profile is not a valid riser profile symbol.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The run type has no riser so the data being set is not applicable.
See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace